hw3/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY title
---
  def index

    unless session[:ratings]
      session[:ratings] = Hash[Movie.ratings.collect { |r| [r, 1] }]